And another longread. I'm sorry...

@bpg
I'm not exactly sure what is the reason but it probably needs to be highlighted in documentation.
When you create a VM template do not forget to set "started = false". Default is "true" which is sane but not for template considering it's not supposed to be ran at all.
Else you'll be getting updates in-place on any plan generation even though VM itself wouldn't be started ever:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.proxmox.proxmox_virtual_environment_vm.template_ubuntu_2204 will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "template_ubuntu_2204" {
        id                      = "1011"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "template-ubuntu-22.04"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "template-ubuntu-22.04",
            "templates",
            "terraform",
        ]
        # (21 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```


Also, even with "started = false" i'm still getting this "architecture" update for template VM after it was already created (once on the next plan generation):

```
...
module.proxmox.proxmox_virtual_environment_vm.template_ubuntu_2204: Creating...
module.proxmox.proxmox_virtual_environment_vm.template_ubuntu_2204: Creation complete after 7s [id=1011]

ratiborus@HOMEWORLD:~/WORKSPACE/terraform_yandex/proxmox$ terraform apply
...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.proxmox.proxmox_virtual_environment_vm.template_ubuntu_2204 will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "template_ubuntu_2204" {
        id                      = "1011"
        name                    = "template-ubuntu-22.04"
        tags                    = [
            "template-ubuntu-22.04",
            "templates",
            "terraform",
        ]
        # (24 unchanged attributes hidden)

      ~ cpu {
          + architecture = "x86_64"
            # (7 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

It happens only once after template VM resource creation and also does not happen if i recreate resource (i.e. with "terraform taint"). No difference whether "template = true" or "false".
I also tried it on other Linux distribution (Astra) and the result is the same. Here's test resources:

```
resource "proxmox_virtual_environment_file" "cloud_image_ubuntu_2204" {
  content_type = "iso"
  datastore_id = "local"
  node_name    = "prox-srv1"

  source_file {
    path = "https://cloud-images.ubuntu.com/releases/22.04/release/ubuntu-22.04-server-cloudimg-amd64.img"
  }
}

resource "proxmox_virtual_environment_vm" "template_ubuntu_2204" {
  name        = "template-ubuntu-22.04"
  description = "Ubuntu 22.04 template"
  tags        = sort(["terraform", "templates", "template-ubuntu-22.04"])
  pool_id     = proxmox_virtual_environment_pool.templates.id

  node_name     = "prox-srv1"
  vm_id         = 1011
  migrate       = true
  on_boot       = false
  started       = false
  template      = true
  scsi_hardware = "virtio-scsi-single"

  agent {
    enabled = true
    trim    = true
  }

  cpu {
    architecture = "x86_64"
    cores        = 1
    numa         = true
    sockets      = 2
    type         = "host"
  }

  memory {
    dedicated    = 2048
  }

  disk {
    datastore_id = "local"
    file_id      = proxmox_virtual_environment_file.cloud_image_ubuntu_2204.id
    file_format  = "qcow2"
    interface    = "scsi0"
    cache        = "none"
    size         = 20
    discard      = "on"
    iothread     = true
    ssd          = true
  }

  initialization {
    datastore_id = "local"
    interface    = "ide2"
    ip_config {
      ipv4 {
        address = "dhcp"
      }
    }
    user_data_file_id = proxmox_virtual_environment_file.cloud_config_userdata.id
  }

  network_device {
    bridge = "vmbr0"
  }

  operating_system {
    type = "l26"
  }

  serial_device {
    device = "socket"
  }

  vga {
    enabled = true
    memory  = 32
    type    = "serial0"
  }

  # lifecycle {
  #   ignore_changes = [
  #     initialization[0].user_data_file_id
  #   ]
  # }
}
```

Not sure but maybe all that info should be covered in a dedicated issue? Just feel like i'm a bit off-topic here and deluting main question :)